# Задача 3: Периметр и площадь прямоугольника
# Напишите программу, которая запрашивает у пользователя длину и ширину прямоугольника и выводит его периметр и площадь.
# Пример:
# Ввод: 4, 7
# Вывод: Периметр: 22, Площадь: 28
a = int(input())
b = int(input())
c = a*b
d = 2*(a+b)
print ('Площадь равна', c, 'Периметр равен', d)